// 6 значений приводятся к false 
// 1   -   0
// 2   -   NaN
// 3   -   null
// 4   -   underfined
// 5   -   пустая строка "" или ''
// 6   -   false


// Логическое И     &&
// и запинается на первом false и возвращает его
// если не нашел false то возвращает последнее значение 


// Логическое ИЛИ     ||
// запинается на true и возвращает его
// или послежний операнд если не нашло ниодного true 


// Логичесоке НЕ       !
// делает инверсию и возвращает инверсию

// console.log(!false);
// console.log(!0);
// console.log(!'jhgajk');


